ticket_Buy-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: ticket_Buy-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: ticket_Buy-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  ticket_Buy-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: selectHall
      actions:
      - resizeWindow(1920,880)
      - go(https://qamid.tmweb.ru/client/index.php)
      - 'clickByLinkText(14:00)'
    - label: selectSeat
      actions:
      - clickByXPath(//div[5]/span[5])
      - clickByCSS(button.acceptin-button)
    - label: code
      actions:
      - clickByCSS(button.acceptin-button)

  ticket_Buy-Http:
    headers:
      sec-ch-ua: '"Chromium";v="106", "Google Chrome";v="106", "Not;A=Brand";v="99"'
      sec-ch-ua-platform: '"Windows"'
      sec-ch-ua-mobile: '?0'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/106.0.0.0 Safari/537.36'
    requests:
      - transaction: selectHall
        force-parent-sample: false
        do:
          - url: 'https://qamid.tmweb.ru/client/scripts/selectSeance.php'
            method: POST
            label: 'https://qamid.tmweb.ru/client/scripts/selectSeance.php'
            headers:
              Content-Type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              seanceId: '94'
              seanceTimeStamp: '1667041200'
          - url: 'https://qamid.tmweb.ru/client/hall.php'
            method: GET
            label: 'https://qamid.tmweb.ru/client/hall.php'
            think-time: 73ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
      - transaction: selectSeat
        force-parent-sample: false
        do:
          - url: 'https://qamid.tmweb.ru/client/scripts/reservation.php'
            method: POST
            label: 'https://qamid.tmweb.ru/client/scripts/reservation.php'
            headers:
              Content-Type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              hallConfiguration: "\n          <div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_vip\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_vip\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart buying-scheme__chair_selected\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__row\"><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span><span class=\"buying-scheme__chair buying-scheme__chair_standart\"></span></div><div class=\"buying-scheme__hall-wrapper__save-status\"></div>        "
              salesPlaces: '[{"row":5,"place":5,"type":"standart"}]'
          - url: 'https://qamid.tmweb.ru/client/payment.php'
            method: GET
            label: 'https://qamid.tmweb.ru/client/payment.php'
            think-time: 126ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
      - transaction: code
        force-parent-sample: false
        do:
          - url: 'https://qamid.tmweb.ru/client/scripts/sale_save.php'
            method: GET
            label: 'https://qamid.tmweb.ru/client/scripts/sale_save.php'
            think-time: 26513ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'